elpaca.org
#+title: Emacs Configuration
#+author: Randy Ridenour
#+DATE: Time-stamp: <Last changed 2025-06-05 07:27:02 by rlridenour>
#+email: rlridenour@fastmail.com
#+STARTUP: overview
#+PROPERTY: header-args :tangle init.el
#+auto_tangle: t

* Early Init File
:PROPERTIES:
:header-args: :tangle early-init.el
:END:

** Header

Set the header and prevent package initialization.

#+begin_src emacs-lisp
  ;; early-init.el -*- lexical-binding: t; -*-
#+end_src

#+begin_src emacs-lisp :lexical t
  (setq package-enable-at-startup nil)
  (setq inhibit-default-init nil)
#+end_src

** Performance

*** Garbage Collection

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum
	gc-cons-percentage 1)

  (defun +gc-after-focus-change ()
    "Run GC when frame loses focus."
    (run-with-idle-timer
     5 nil
     (lambda () (unless (frame-focus-state) (garbage-collect)))))
#+end_src

Raise max lisp nesting depth.

#+begin_src emacs-lisp
  (setq max-lisp-eval-depth 10000)
#+end_src

#+begin_src emacs-lisp :lexical t
  (defun +reset-init-values ()
    (run-with-idle-timer
     1 nil
     (lambda ()
       (setq file-name-handler-alist default-file-name-handler-alist
	     gc-cons-percentage 0.1
	     gc-cons-threshold 100000000)
       (let ((inhibit-message t))
	 (message "gc-cons-threshold & file-name-handler-alist restored"))
       (message "ELPACA LOADING COMPLETE: %s" (emacs-init-time))
       (when (boundp 'after-focus-change-function)
	 (add-function :after after-focus-change-function #'+gc-after-focus-change)))))

  (with-eval-after-load 'elpaca
    (add-hook 'elpaca-after-init-hook '+reset-init-values))
#+end_src

*** Native Comp

Improve execution speed.

#+begin_src emacs-lisp
  (customize-set-variable 'native-comp-speed 2)
  (customize-set-variable 'native-comp-deferred-compilation t)
#+end_src

Silence native compilation warnings.

#+begin_src emacs-lisp
  (setq native-comp-async-report-warnings-errors nil)
#+end_src

*** File-Name-Handler-Alist

Skipping a bunch of regular expression searching in the =file-name-handler-alist= should improve start time.

#+begin_src emacs-lisp :lexical t
  (defvar default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src

** Personal Identification

Set my name and email.

#+begin_src emacs-lisp
  (setq user-full-name "Randy Ridenour"
	user-mail-address "rlridenour@fastmail.com")
#+end_src

** UI

*** Clean Up UI

Remove unnecessary GUI elements.

#+begin_src emacs-lisp
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1)
  (setq-default frame-inhibit-implied-resize t)
  (setq-default inhibit-startup-screen t)
  (setq-default inhibit-startup-message t)
  (setq-default initial-scratch-message nil)
  (setq use-dialog-box nil)
#+end_src

Make scrolling smoother.

#+begin_src emacs-lisp
  (setq scroll-conservatively 10
	scroll-margin 0)
#+end_src

*** Initial Frame

Set initial frame size to fullheight.

#+begin_src emacs-lisp
  (setq frame-resize-pixelwise t)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

Bring new frame to front. From [[https://www.reddit.com/r/emacs/comments/1g2hkh8/a_useful_snippet_to_bring_emacs_client_to_the/][a useful snippet to bring emacs client to the front on OS X : r/emacs]].

#+begin_src emacs-lisp
  (defun initd/bring-emacs-to-front ()
    "Using applescript, force the Emacs frame to be activated."
    (when (eq system-type 'darwin)
      (start-process "bring-emacs-to-front" nil
		     "osascript"
		     "-e"
		     "tell application \"Emacs\" to activate")))
  (add-hook 'server-after-make-frame-hook #'initd/bring-emacs-to-front)
#+end_src

Set the frame title format.

#+begin_src emacs-lisp :tangle no
  (setq-default cursor-in-non-selected-windows nil
		frame-title-format '("%f [%m]"))
#+end_src

Set window title to file name.

#+begin_src emacs-lisp
  (setq frame-title-format
	'(buffer-file-name (:eval (abbreviate-file-name buffer-file-name))
			   (dired-directory dired-directory
					    "%b")))
#+end_src

Focus new frames

#+begin_src emacs-lisp
  (defun rr/focus-new-client-frame ()
    (select-frame-set-input-focus (selected-frame)))
  (add-hook 'server-after-make-frame-hook #'rr/focus-new-client-frame)
#+end_src

** Font

Set font to Apple's San Francisco

#+begin_src emacs-lisp
  ;; Main typeface
  (set-face-attribute 'default nil :family "SF Mono" :height 160 :weight 'medium)
  ;; Proportionately spaced typeface
  (set-face-attribute 'variable-pitch nil :family "SF Pro Text" :height 1.0 :weight 'medium)
  ;; Monospaced typeface
  (set-face-attribute 'fixed-pitch nil :family "SF Mono" :height 1.0 :weight 'medium)
#+end_src

Increase font size.

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :height 160)
#+end_src

Add some space between lines.

#+begin_src emacs-lisp
  (setq-default line-spacing 0.25)
#+end_src

** Footer

#+begin_src emacs-lisp
  ;; Local Variables:
  ;; no-byte-compile: t
  ;; no-native-compile: t
  ;; no-update-autoloads: t
  ;; End:
#+end_src

* Package Management

#+begin_src emacs-lisp
  ;;; init.el --- Personal Emacs configuration file -*- lexical-binding: t; -*-
#+end_src

** Elpaca Install

#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
				:ref nil :depth 1 :inherit ignore
				:files (:defaults "elpaca-test.el" (:exclude "extensions"))
				:build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
	 (build (expand-file-name "elpaca/" elpaca-builds-directory))
	 (order (cdr elpaca-order))
	 (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
	  (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
		    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
						    ,@(when-let* ((depth (plist-get order :depth)))
							(list (format "--depth=%d" depth) "--no-single-branch"))
						    ,(plist-get order :repo) ,repo))))
		    ((zerop (call-process "git" nil buffer t "checkout"
					  (or (plist-get order :ref) "--"))))
		    (emacs (concat invocation-directory invocation-name))
		    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
					  "--eval" "(byte-recompile-directory \".\" 0 'force)")))
		    ((require 'elpaca))
		    ((elpaca-generate-autoloads "elpaca" repo)))
	      (progn (message "%s" (buffer-string)) (kill-buffer buffer))
	    (error "%s" (with-current-buffer buffer (buffer-string))))
	((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

** Elpaca Use-Package Support

Load org first to avoid version mismatch problems.

#+begin_src emacs-lisp
  (elpaca (org :wait t))
#+end_src

#+begin_src emacs-lisp
  (elpaca elpaca-use-package
    (require 'elpaca-use-package)
    (elpaca-use-package-mode)
    (setq use-package-always-ensure t)
    (setq use-package-always-defer t))
#+end_src

*** Use Feature

#+begin_src emacs-lisp :lexical t
  (defmacro use-feature (name &rest args)
    "Like `use-package' but accounting for asynchronous installation.
    NAME and ARGS are in `use-package'."
    (declare (indent defun))
    `(use-package ,name
       :ensure nil
       ,@args))
#+end_src

*** After Elpaca Init

Use this macro for code that needs to run after Elpaca.

#+begin_src emacs-lisp
  (defmacro with-after-elpaca-init (&rest body)
    "Adds BODY to `elpaca-after-init-hook`"
    `(add-hook 'elpaca-after-init-hook (lambda () ,@body)))
#+end_src

** Keybinding and Menus
*** General

Load general before the remaining packages so they can make use of the ~:general~ keyword in their declarations.

#+begin_src emacs-lisp :lexical t
  (use-package general
    :ensure (:wait t)
    :demand
    :config
    (general-override-mode)
    (general-auto-unbind-keys)
    (general-unbind
      "C-z"
      "H-w"
      "s-p"
      "s-q"
      "s-w"
      "s-m"
      "s-n"
      "s-h"
      "s-,"))
#+end_src

*** Key Chord

#+begin_src emacs-lisp
  (use-package key-chord
    :config
    (key-chord-mode 1))
#+end_src

*** Hydra

#+begin_src emacs-lisp
  (use-package major-mode-hydra
    :commands (pretty-hydra-define)
    :general
    ("s-m" #'major-mode-hydra))
#+end_src

*** Casual Suite

#+begin_src emacs-lisp
  (use-package casual
    :ensure
    (:type git :host github :repo "kickingvegas/casual")
    :general
    ("s-." #'casual-editkit-main-tmenu)
    (:keymaps 'reb-mode-map
	      "s-." #'casual-re-builder-tmenu)
    (:keymaps 'calc-mode-map
	      "s-." #'casual-calc-tmenu)
    (:keymaps 'dired-mode-map
	      "s-." #'casual-dired-tmenu)
    (:keymaps 'isearch-mode-map
	      "s-." #'casual-isearch-tmenu)
    (:keymaps 'ibuffer-mode-map
	      "s-." #'casual-ibuffer-tmenu
	      "F" #'casual-ibuffer-filter-tmenu
	      "s" #'casual-ibuffer-sortby-tmenu)
    (:keymaps 'bookmark-bemenu-mode-map
	      "s-." #'casual-bookmarks-tmenu)
    (:keymaps 'org-agenda-mode-map
	      "s-." #'casual-agenda-tmenu)
    (:keymaps 'Info-mode-map
	      "s-." #'casual-info-tmenu)
    (:keymaps 'calendar-mode-map
	      "s-." #'casual-calendar-tmenu)
    )
#+end_src

*** Discover

From [[https://github.com/mickeynp/discover.el][mickeynp/discover.el: Discover more of emacs with context menus!]]

#+begin_src emacs-lisp
  (use-package discover
    :config
    (global-discover-mode 1))
#+end_src

* File Locations
** Set Path

Use Exec-Path-From-Shell to set path.

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
#+end_src

** Variables

#+begin_src emacs-lisp
  (defconst rr-emacs-dir (expand-file-name user-emacs-directory)
    "The path to the emacs.d directory.")

  (defconst rr-cache-dir "~/.cache/emacs/"
    "The directory for Emacs activity files.")

  (defconst rr-backup-dir (concat rr-cache-dir "backup/")
    "The directory for Emacs backup files.")

  (defconst rr-org-dir "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/"
    "The directory for my org files.")

  (defconst rr-agenda-dir "/Users/rlridenour/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/org/"
    "The directory for RR-Emacs note storage.")

  (defconst rr-notes-dir "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/Documents/notes/"
    "The directory for RR-Emacs note storage.")
#+end_src

** Create directories

#+begin_src emacs-lisp
    ;;;; Create directories if non-existing
  (dolist (dir (list rr-cache-dir
		     rr-backup-dir))
    (unless (file-directory-p dir)
      (make-directory dir t)))
#+end_src

** Elisp

Add elisp directory to load path.

#+begin_src emacs-lisp
  (add-to-list 'load-path (concat rr-emacs-dir "elisp"))
#+end_src

** Backups

Backup files are in ~/Users/rlridenour/.cache/emacs/backup/~.

#+begin_src emacs-lisp
  (setq backup-directory-alist (list (cons "."  rr-backup-dir)))
#+end_src

Always backup by copying.

#+begin_src emacs-lisp
  (setq backup-by-copying t)
#+end_src

Delete old backup files

#+begin_src emacs-lisp
  (setq delete-old-versions t)
#+end_src

Keep 5 backup files

#+begin_src emacs-lisp
  (setq kept-new-versions 5)
#+end_src

Make numeric backup versions

#+begin_src emacs-lisp
  (setq version-control t)
#+end_src

Do not automatically save files.

#+begin_src emacs-lisp
  (setq auto-save-default nil)
#+end_src

Don't make all those files that look like =#foo.ext=.

#+begin_src emacs-lisp
  (setq create-lockfiles nil)
#+end_src

** Bookmarks

#+begin_src emacs-lisp
  (use-feature bookmark
    :config
    (require 'bookmark)
    (bookmark-bmenu-list)
    (setq bookmark-save-flag 1))
#+end_src

** Trash

Send deleted files to an Emacs folder in system trash.

#+begin_src emacs-lisp
  (setq delete-by-moving-to-trash t
	trash-directory "~/.Trash/emacs")
#+end_src

** Open Config

*** Emacs Config

Open Emacs init file in fixed-pitch mode.

#+begin_src emacs-lisp
  (defun rr/open-init-file ()
    (interactive)
    (progn (find-file "~/.config/emacs/init.org")
	   (variable-pitch-mode -1)))
#+end_src

*** Fish Functions

Open fish functions directory.

#+begin_src emacs-lisp
  (defun open-fish-functions ()
    (interactive)
    (dired "~/.config/fish/functions"))
#+end_src

* Completion

